In [1]:
import pandas as pd
import numpy as np

In [12]:
number_list = np.arange(0,8)
number_list

array([0, 1, 2, 3, 4, 5, 6, 7])

In [3]:
names =["Steve", "ryan", "Shikwekwe", "Must_Go"]
age = [18,25,36,47]
gender = ["Female","Male","Male", "Male"]

In [4]:
dataframe = pd.DataFrame({"Name":names,
"age":age,
"gender":gender})
dataframe

        Name  age  gender
0      Steve   18  Female
1       ryan   25    Male
2  Shikwekwe   36    Male
3    Must_Go   47    Male

In [5]:
dataframe_1 = pd.Series({"Name":names,
"age":age,
"gender":gender})
dataframe_1

Name      [Steve, ryan, Shikwekwe, Must_Go]
age                        [18, 25, 36, 47]
gender           [Female, Male, Male, Male]
dtype: object

In [6]:
pd.Series(dataframe_1["Name"])

0        Steve
1         ryan
2    Shikwekwe
3      Must_Go
dtype: object

In [7]:
dataframe.head()

        Name  age  gender
0      Steve   18  Female
1       ryan   25    Male
2  Shikwekwe   36    Male
3    Must_Go   47    Male

In [8]:
dataframe.tail(2)

        Name  age gender
2  Shikwekwe   36   Male
3    Must_Go   47   Male

In [9]:
dataframe.describe()

             age
count   4.000000
mean   31.500000
std    12.714821
min    18.000000
25%    23.250000
50%    30.500000
75%    38.750000
max    47.000000

In [10]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   age     4 non-null      int64
 2   gender  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes